Revit 2027 API
BuiltInFailures.IlluminationFailures Class
 Failures about Illumination.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class IlluminationFailures
Public NotInheritable Class IlluminationFailures
public ref class IlluminationFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type IlluminationFailures = class end
The BuiltInFailures.IlluminationFailures type exposes the following members.
Properties
Name | Description
IESFileNotFoundWarning |  Estimated Illumination failed. IES file not found for lighting fixture.
LightingFixtureLumensWarning |  Estimated Illumination failed. Lumens not set for lighting fixture.
RoomCoefficientUtilizationWarning |  Estimated Illumination failed. Coefficient of utilization not set for lighting fixture.
RoomLightLossFactorWarning |  Estimated Illumination failed. Light Loss factor not set for lighting fixture.
Top
See Also
Reference
Autodesk.Revit.DB Namespace